Revit 2027 API
BuiltInFailures.RoofFailures.OnlyOneSlopeCurtainRoof Property
 Only one slope in curtain roof.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId OnlyOneSlopeCurtainRoof { get; }
Public Shared ReadOnly Property OnlyOneSlopeCurtainRoof As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ OnlyOneSlopeCurtainRoof {
	FailureDefinitionId^ get ();
}
static member OnlyOneSlopeCurtainRoof : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoofFailures Class
Autodesk.Revit.DB Namespace